Revit 2026 API

# SolidFaces Property

---

The faces that belong to the solid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FaceArray Faces { get; }
```
```vb
Public ReadOnly Property Faces As FaceArray
	Get
```
```cpp
public:
property FaceArray^ Faces {
	FaceArray^ get ();
}
```
```fsharp
member Faces : FaceArray with get
```

#### Property Value

FaceArray

A face may be degenerate. This can be determined with the Face property IsTwoSided.

#### Reference

Solid Class

Autodesk.Revit.DB Namespace